Autodesk.Revit.DB.Electrical.WireTypeSet
A set that contains wire types.

Autodesk.Revit.DB.Electrical.WireTypeSet.Insert(Autodesk.Revit.DB.Electrical.WireType)
System.Int32
Insert the specified wire type into the set.
item: The wire type to be inserted into the set.
Returns: Returns whether the wire type was inserted into the set.

Autodesk.Revit.DB.Electrical.WireTypeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Electrical.WireTypeSet.ReverseIterator
Autodesk.Revit.DB.Electrical.WireTypeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.Electrical.WireTypeSet.ForwardIterator
Autodesk.Revit.DB.Electrical.WireTypeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Electrical.WireTypeSet.Erase(Autodesk.Revit.DB.Electrical.WireType)
System.Int32
Removes a specified wire type from the set.
item: The wire type to be erased.
Returns: The number of wire types that were erased from the set.

Autodesk.Revit.DB.Electrical.WireTypeSet.Contains(Autodesk.Revit.DB.Electrical.WireType)
System.Boolean
Tests for the existence of a wire type within the set.
item: The wire type to be searched for.
Returns: The Contains method returns True if the wire type is within the set, otherwise False.

Autodesk.Revit.DB.Electrical.WireTypeSet.Clear
void
Removes every wire type from the set, rendering it empty.

Autodesk.Revit.DB.Electrical.WireTypeSet.Size
System.Int32
get
Returns the number of wire types that are in the set.

Autodesk.Revit.DB.Electrical.WireTypeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.